NHS_getPatientDetailsByNHSNumber.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:itk="urn:nhs-itk:ns:201005">
    <soap:Header>
        <wsa:MessageID>B72F7785-534C-11E6-ADCA-29C651A3BE6F</wsa:MessageID>
        <wsa:Action>urn:nhs-itk:services:201005:getPatientDetailsByNHSNumber-v1-0</wsa:Action>
        <wsa:To>https://192.168.128.11/smsp/pds</wsa:To>
        <wsa:From>
            <wsa:Address>192.168.54.7</wsa:Address>
        </wsa:From>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsu:Timestamp wsu:Id="D6CD5232-14CF-11DF-9423-1F9A910D4703" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsu:Created>2016-07-27T11:10:23Z</wsu:Created>
                <wsu:Expires>2020-07-27T11:20:23Z</wsu:Expires>
            </wsu:Timestamp>
            <wsse:UsernameToken>
                <wsse:Username>TKS Server test</wsse:Username>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <itk:DistributionEnvelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <itk:header service="urn:nhs-itk:services:201005:getPatientDetailsByNHSNumber-v1-0" trackingid="2D37D9CA-5223-41C7-A159-F33D5A914EB5">
                <itk:auditIdentity>
                    <itk:id type="1.2.826.0.1285.0.2.0.107" uri="868000003114"/>
                </itk:auditIdentity>
                <itk:manifest count="1">
                    <itk:manifestitem id="uuid_808A967-49B2-498B-AD75-1D7A0F1262D7" mimetype="text/xml" profileid="urn:nhs-en:profile:getPatientDetailsByNHSNumberRequest-v1-0" base64="false" compressed="false" encrypted="false"/>
                </itk:manifest>
                <itk:senderAddress uri="urn:nhs-uk:addressing:ods:rhm:team1:C"/>
            </itk:header>
            <itk:payloads count="1">
                <itk:payload id="uuid_808A967-49B2-498B-AD75-1D7A0F1262D7">
                    <getPatientDetailsByNHSNumberRequest-v1-0 moodCode="EVN" classCode="CACT" xmlns="urn:hl7-org:v3">
                        <id root="16C2662F-1C6E-4F38-9B3F-5084F46CE3E2"/>
                        <code codeSystem="2.16.840.1.113883.2.1.3.2.4.17.284" code="getPatientDetailsByNHSNumberRequest-v1-0"/>
                        <queryEvent>
                            <Person.DateOfBirth>
                                <value value="19770705"/>
                                <semanticsText>Person.DateOfBirth</semanticsText>
                            </Person.DateOfBirth>
                            <Person.NHSNumber>
                                <value root="2.16.840.1.113883.2.1.4.1" extension="9473480032"/>
                                <semanticsText>Person.NHSNumber</semanticsText>
                            </Person.NHSNumber>
                        </queryEvent>
                    </getPatientDetailsByNHSNumberRequest-v1-0>
                </itk:payload>
            </itk:payloads>
        </itk:DistributionEnvelope>
    </soap:Body>
</soap:Envelope>